# ToggleToPerspective Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View3D..::..ToggleToPerspective Method
View3D Class See Also
---
Toggles this view to perspective.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015 Subscription Update
# Syntax
C#
---
```text
public void ToggleToPerspective()
```

Visual Basic
---
```text
Public Sub ToggleToPerspective
```

Visual C++
---
```text
public:
void ToggleToPerspective()
```

# Remarks
This view can only be toggled to perspective if no view specific elements are contained.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This view cannot be toggled. |

# See Also
View3D Class
Autodesk.Revit.DB Namespace